<!DOCTYPE html>
<html lang="ru">
    <head>
            <meta charset="UTF-8">
        <meta name="viewport" content="width=device-width, inital-scale=1.0">
        <title><?= "Математические операции"; ?></title>
    </head>
    <body>
        <?php
            $x = 10;
            $y = 20;

            echo $x + $y . "<br>"; //Сумма, "<br>" - перевод на новую строку
            echo $x - $y . "<br>"; //Рахность
            echo $x / $y . "<br>"; //Деление
            echo $x * $y . "<br>"; //Умножение

            $x += 8; //Умная сумма - $x = $x + (значение)
            $y -= 5; //Умное вычитание $y = $y - (значение)
            echo $x . "<br>";

            $x--; //$x = $x - 1
            $x++; //$x = $ + 1

            echo M_PI . "<br>"; //Число pi
            echo M_E ."<br>"; // Натуральное число

            echo abs($x - $y) . "<br>"; //Взятие числа по модулю
            echo ceil(2.9) . "<br>"; //Округление числа к большему значению
            echo floor(2.9) . "<br>"; //Округление числа к меньшему значению
            echo round(3.9) . "<br>"; //Округление по правилам математики
            echo round(0.555565585848, 2) . "<br>"; //Округление + вывод n количества значений после запятой
            echo mt_rand(1, 40); //Вывод случайного значения в заданном диапазоне
        ?>
    </body>
</html>